Repository: Clear-Bible/eng-tpi-tm
Catalog: output.tmx
Source language: en_us
Languages: tpi

source: a
tpi: planti

source: abandon
tpi: lusim

source: about
tpi: samting

source: above
tpi: antap long

source: accelerator
tpi: akselareta

source: accident
tpi: birua

source: accuse
tpi: sutim long tok

source: acquaintance
tpi: poro

source: acquitted
tpi: winim kot

source: address
tpi: adres

source: adhesive/sticking plaster
tpi: plasta

source: adult
tpi: bikpela man

source: advertisement
tpi: toksave

source: aerogramme
tpi: leta pas

source: aeroplane
tpi: balus

source: affines
tpi: tambu

source: afraid
tpi: pret

source: afternoon
tpi: apinun

source: again
tpi: gen

source: against
tpi: i go long

source: aggressive person
tpi: man bilong pait

source: agree
tpi: yesa

source: agreement
tpi: wanbel

source: agricultural officer
tpi: didiman

source: air
tpi: win

source: airplane
tpi: balus

source: airport
tpi: ples balus

source: alive
tpi: i gat laip

source: all
tpi: olgeta

source: allow
tpi: larim

source: almost
tpi: klostu

source: alone
tpi: wanpela tasol

source: along
tpi: long

source: already
tpi: yet

source: also
tpi: tu

source: altar
tpi: alta

source: altar cloth
tpi: laplap bilong alta

source: although
tpi: maski

source: always
tpi: oltaim

source: ambiguous
tpi: karamapim tok

source: among
tpi: namel long

source: an
tpi: wanpela

source: ancestors
tpi: tumbuna

source: anchor
tpi: anka

source: and
tpi: na

source: angel
tpi: ensel

source: angry
tpi: kros

source: angry with
tpi: krosim

source: animal
tpi: abus

source: annoy
tpi: hambak

source: annoying person
tpi: hambakman

source: annul a marriage
tpi: katim marit

source: another one
tpi: narakain

source: answer
tpi: ansaim

source: antiseptic
tpi: marasin bilong kilim jem

source: anus
tpi: as

source: apart from
tpi: abrus long

source: apartment
tpi: rum

source: appear in court
tpi: sanap long kot

source: approximately
tpi: samting

source: April
tpi: Epril

source: area
tpi: hap

source: areca nut
tpi: buai

source: areca palm
tpi: limbum

source: arm
tpi: han

source: army
tpi: ami

source: around
tpi: nabaut

source: arrive
tpi: kamap

source: arrow
tpi: supia bilong banara

source: arrow or spear
tpi: supia i gat huk

source: art
tpi: samting tumbuna

source: art gallery
tpi: haus tambaran

source: artery
tpi: mambu bilong blut

source: artificial
tpi: man i wokim

source: as long as
tpi: longpela olsem

source: as soon as
tpi: stret long taim

source: ascend
tpi: go antap

source: ash
tpi: sit bilong paia

source: ask
tpi: askim

source: at
tpi: liklik tru

source: attempt
tpi: traim

source: attractive
tpi: naispela

source: August
tpi: Ogas

source: Australia
tpi: Ostrelia

source: avoid
tpi: abrusim

source: awake
tpi: i na slip

source: axe
tpi: akis

source: baby
tpi: pikinini

source: baby not yet weaned
tpi: pikinini i dring susu yet

source: back
tpi: baksait

source: backbone
tpi: bekbun

source: backwards
tpi: long bek

source: bad
tpi: nogut

source: bag
tpi: bek

source: baggage
tpi: kago

source: bail up
tpi: hansapim

source: bake
tpi: kukim

source: ballpoint
tpi: pen bolpoin or biro

source: bamboo
tpi: mambu

source: band
tpi: paspas

source: bandage a wound
tpi: pasim sua

source: bandicoot
tpi: mumut

source: bank
tpi: beng

source: baptize
tpi: wasim

source: bar
tpi: ba

source: barbecue
tpi: kukim long paia

source: barbecue sauce
tpi: blakpela sos

source: barbed
tpi: supia i gat huk

source: bark
tpi: skin

source: barman
tpi: baman

source: bartender
tpi: baman

source: base
tpi: as

source: basis
tpi: as

source: bathe
tpi: waswas

source: bathroom
tpi: ples waswas

source: battery
tpi: bateri

source: be
tpi: lukaut long

source: be asleep
tpi: slip

source: be better than
tpi: winim

source: be erect
tpi: sanap

source: be in a place
tpi: stap

source: be in charge of
tpi: bosim

source: be jealous of
tpi: mangalim

source: beach
tpi: nambis

source: beads
tpi: bis

source: beans
tpi: bin

source: beard
tpi: gras usket

source: beat
tpi: paitim

source: beat up
tpi: paitim

source: beautiful
tpi: nais

source: because
tpi: bilong wanem

source: become
tpi: kamap

source: bed
tpi: bet

source: bedroom
tpi: rum slip

source: beef
tpi: bulmakau

source: beer
tpi: bia

source: before
tpi: bipo

source: begin
tpi: kirapim

source: behave oneself
tpi: stap isi

source: behaviour
tpi: pasin

source: behind
tpi: bihain long

source: believe
tpi: bilip

source: bell
tpi: belo

source: belly
tpi: bel

source: belt
tpi: let

source: bend
tpi: krungutim

source: beside
tpi: arere long

source: best
tpi: nambawan

source: betelnut
tpi: buai

source: better
tpi: mobeta

source: Bible
tpi: Baibel

source: bicycle
tpi: wilwil

source: big
tpi: bikpela

source: bill
tpi: bil

source: binoculars
tpi: glas bilong kapten

source: bird
tpi: pisin

source: Bird of Paradise
tpi: kumul

source: biscuit
tpi: bisket

source: bite
tpi: kaikaim

source: bite off
tpi: brukim/katim lo

source: bitter
tpi: em i pait

source: black
tpi: blakpela

source: black palm
tpi: wailimbung

source: bleed
tpi: blut i kamap

source: blind
tpi: aipas

source: blind in one eye
tpi: matakiau

source: blood
tpi: blut

source: blow
tpi: winim

source: blow bugle
tpi: winim bugol

source: blow out a match
tpi: mekim i masis

source: bludger
tpi: pasindia

source: blue
tpi: blu

source: board
tpi: kalap

source: board a PMV
tpi: kalap long PM

source: boat
tpi: bot

source: boat's crew
tpi: boskru

source: body
tpi: bodi

source: boil
tpi: buk

source: bolt
tpi: skru

source: bone
tpi: bun

source: book
tpi: buk

source: bookshop
tpi: buksop

source: boot
tpi: bikpela su

source: border
tpi: arere

source: born
tpi: mama i karim

source: borrow
tpi: dinau

source: boss
tpi: masta

source: both
tpi: tupela

source: bottle
tpi: botol

source: bottom
tpi: ananit

source: bow
tpi: banara

source: box
tpi: bokis

source: boy
tpi: boi

source: boyfriend
tpi: boipren

source: bra
tpi: banis bilong susu

source: brain
tpi: kru bilong het

source: brake
tpi: brek

source: branch of tree
tpi: han bilong diwai

source: brassiere
tpi: banis bilong susu

source: brave
tpi: i no save pret

source: bread
tpi: bret

source: breadfruit
tpi: kapiak

source: break
tpi: brukim

source: breakfast
tpi: kaikai long moning

source: breast
tpi: susu

source: breath
tpi: win

source: breathe
tpi: pulim win

source: bridge
tpi: bris

source: bright
tpi: lait

source: bring
tpi: bringim

source: broken
tpi: bruk

source: broken bone
tpi: bun i bruk

source: brooch
tpi: bros

source: brothel
tpi: haus pamuk

source: brother
tpi: brata

source: brown
tpi: braun

source: brush
tpi: bras

source: bubble gum
tpi: abababa

source: build
tpi: wokim

source: building
tpi: haus

source: bulb
tpi: kiau

source: bullybeef
tpi: skweamit

source: bump
tpi: bamim

source: bundle
tpi: karamap

source: burn
tpi: kukim

source: Burns Philp
tpi: Bipi

source: bury
tpi: planim

source: bus
tpi: bas

source: bush
tpi: bus

source: businessman
tpi: man bisnis

source: busy
tpi: i gat wok

source: but
tpi: tasol

source: butter
tpi: bata

source: buttock
tpi: as

source: button
tpi: baten

source: buttress root
tpi: kil bilong diwai

source: buy
tpi: baim

source: cabbage
tpi: kabis

source: cake
tpi: kek

source: calendar
tpi: kalenda

source: calf of leg
tpi: baksait bilong lek

source: call out
tpi: singaut

source: calm
tpi: belisi

source: camera
tpi: kamera

source: can
tpi: tin

source: candle
tpi: kandel

source: candy
tpi: loli

source: cane
tpi: kanda

source: canoe
tpi: kanu

source: canvas stretcher
tpi: bet sel

source: cap
tpi: hat

source: captain
tpi: kapten

source: car
tpi: kar

source: carburetor
tpi: kabureta

source: cards
tpi: kas

source: careful of
tpi: lukaut long

source: carefully
tpi: isi isi

source: cargo
tpi: kago

source: carpet
tpi: mat or tepik

source: carrot
tpi: karet

source: carry
tpi: karim

source: carton
tpi: katen

source: carve
tpi: sapim

source: cassava
tpi: kasava

source: cassette
tpi: kaset

source: cassowary
tpi: muruk

source: castor oil
tpi: kaswel

source: cat
tpi: pusi

source: catch a bus
tpi: baim bas

source: catch fish
tpi: hukim pis

source: catfish
tpi: mausgras

source: Catholic
tpi: Katolik

source: cattle
tpi: bulmakau

source: cause
tpi: as

source: celebrate Mass
tpi: mekim Misa

source: cement
tpi: simen

source: centimetre
tpi: sentimita

source: century
tpi: handet yia

source: certainly
tpi: orait orait

source: chain
tpi: sen

source: chair
tpi: sea

source: chance
tpi: sans

source: change
tpi: senis

source: change money
tpi: senisim

source: charge
tpi: sas

source: chase
tpi: ranim

source: chatter
tpi: sikirapim tok

source: cheap
tpi: i no dia

source: check
tpi: sekim

source: cheeky person
tpi: hambakman

source: cheerio
tpi: lukim yu

source: cheese
tpi: sis

source: cherry
tpi: sirsen

source: chest
tpi: bros

source: chewing gum
tpi: pike

source: chicken
tpi: kakaruk

source: chief
tpi: luluai

source: child
tpi: pikinini

source: chill
tpi: skin i kol

source: chin
tpi: usket

source: chips
tpi: sips

source: chocolate
tpi: soklet

source: choice
tpi: rot

source: chook
tpi: kakaruk

source: choose
tpi: kisim long laik

source: chop
tpi: katim long akis/tamiok

source: chops
tpi: sops

source: chopsticks
tpi: sopstik

source: Christian
tpi: kristen

source: Christmas
tpi: krismas

source: church
tpi: lotu

source: cigarettes
tpi: sigaret

source: cinema
tpi: haus piksa

source: circulatory system
tpi: rot bilong blut

source: city
tpi: biktaun

source: clan
tpi: bisnis

source: clay
tpi: graun

source: clean
tpi: klin

source: clear
tpi: klia

source: clear the table
tpi: klirim tebol

source: clearing
tpi: ples klia

source: clerk
tpi: kuskus

source: clever person
tpi: man bilong save

source: clock
tpi: klok

source: close
tpi: pasim

source: close friend
tpi: wantok

source: closed
tpi: i pas

source: cloth
tpi: laplap

source: clothes
tpi: klos

source: cloud
tpi: klaut

source: clown
tpi: paniman

source: club
tpi: klab

source: clutch
tpi: klats

source: coast
tpi: nambis

source: coastal man
tpi: man bilong nambis

source: coat
tpi: kot

source: Coca
tpi: Cola

source: cockatoo
tpi: koki

source: cocoa
tpi: kakao

source: coconut
tpi: kokonas

source: coffee
tpi: kopi

source: coin
tpi: mani ain

source: cold
tpi: kol

source: colour
tpi: kala

source: comb
tpi: kom

source: comb of chicken/rooster
tpi: plaua bilong kakaruk

source: come
tpi: kam

source: comfortable
tpi: gut moa

source: commercial
tpi: bilong bisnis

source: company
tpi: kampani

source: competition
tpi: resis

source: complain
tpi: kotim

source: completely
tpi: olgeta

source: computer
tpi: komputa

source: con man
tpi: bulsitman

source: conceal
tpi: haitim

source: conceited
tpi: bikhet

source: conceive
tpi: kisim bel

source: concert
tpi: singsing

source: concrete
tpi: simen

source: condensed milk
tpi: strongpela susu

source: condom
tpi: gumi bilong kok

source: confess
tpi: tokautim sin

source: confession
tpi: konpesen

source: conscience
tpi: tok insait

source: constipated
tpi: bel i pas

source: consul
tpi: tultul

source: contain
tpi: holim . . . i stap

source: continue
tpi: skruim . . . i go

source: contraceptive for females
tpi: samting bilong pasim bel

source: contraceptive for males
tpi: gumi bilong kok

source: control
tpi: bosim

source: controversy
tpi: tok pait

source: convenient
tpi: i mekim isi

source: conversation
tpi: toktok

source: converse with
tpi: toktok wantaim

source: convert
tpi: tanim tingting

source: cook
tpi: kuk

source: cookie
tpi: switbiskit

source: cooking pit
tpi: mumu

source: copra
tpi: kopra

source: copy
tpi: bihainim

source: cordyline plant
tpi: tanget

source: corkscrew
tpi: skru tuptup

source: corn
tpi: kon

source: corned beef
tpi: solmit

source: corner
tpi: kona

source: correct
tpi: stret

source: corridor
tpi: ples wokabaut insait long haus

source: cost
tpi: kostim

source: cotton
tpi: katen

source: councillor
tpi: kaunsila

source: count
tpi: kaunim

source: country
tpi: kantri

source: countryside
tpi: bus

source: course
tpi: kos

source: court
tpi: kot

source: courthouse
tpi: kothaus

source: courtyard
tpi: kot

source: cousin
tpi: kasen

source: cover
tpi: tuptup

source: covet
tpi: mangalim

source: coward
tpi: pretman

source: crab
tpi: kuka

source: cracker
tpi: draibisket

source: crayfish
tpi: kindam

source: crazy
tpi: longlong

source: cream
tpi: strongpela susu

source: crew of plane/ship
tpi: boskru bilong balus/sip

source: criminal
tpi: man nogut

source: crocodile
tpi: pukpuk

source: cross
tpi: diwai kros

source: crowd
tpi: planti man na meri

source: crown of tree
tpi: het bilong diwai

source: crumple
tpi: krungutim

source: cry
tpi: krai

source: cucumber
tpi: kukamba

source: cup
tpi: kap

source: cupboard
tpi: kapet

source: curry
tpi: kari

source: curtain
tpi: laplap bilong windo

source: cuscus
tpi: kapul

source: cushion
tpi: pilo

source: custard
tpi: kastet

source: custom
tpi: pasin

source: customs
tpi: kastam

source: cut
tpi: kat

source: daddy
tpi: papa

source: dance and/or sing
tpi: singsing

source: dangerous place
tpi: ples nogut

source: dark
tpi: tudak

source: darkness
tpi: tudak

source: dates
tpi: prut det

source: daughter
tpi: pikinini meri

source: day
tpi: de

source: daytime
tpi: taim long san

source: dead
tpi: i dai pinis

source: deaf
tpi: yaupas

source: dear
tpi: dia

source: debt
tpi: dinau

source: deceive
tpi: karamapim tok

source: December
tpi: Desemba

source: decide
tpi: pasim tingting

source: decorate
tpi: bilasim

source: deep
tpi: godaun tru

source: defecate
tpi: pekpek

source: demand
tpi: singaut long

source: denigrate
tpi: rabisim

source: dense bush
tpi: bikbus

source: dentist
tpi: dentis

source: desert
tpi: ples wesan

source: dessert
tpi: switpela kaikai

source: detain
tpi: holim pas

source: develop
tpi: kamapim

source: devil
tpi: satan

source: dialect
tpi: nek

source: diamond
tpi: daimen

source: diarrhea
tpi: pekpek wara

source: dictionary
tpi: buk bilong painim mining

source: did
tpi: bin

source: die
tpi: dai pinis

source: different
tpi: narakain

source: difficult
tpi: i hatwok

source: difficulty
tpi: asua

source: dig
tpi: digim

source: digestive system
tpi: rot bilong kaikai

source: dinner
tpi: kaikai long belo

source: direction
tpi: i makim rot

source: dirty
tpi: doti

source: disciple
tpi: disaipel

source: discover
tpi: painimautim

source: dish
tpi: dis

source: dismiss
tpi: autim long wok

source: disobey
tpi: sakim tok

source: dispute
tpi: tok pait

source: district
tpi: distrik

source: disturb the peace
tpi: brukim sindaun

source: divorce
tpi: katim marit

source: dizzy
tpi: ai i raun

source: do
tpi: mekim

source: doctor
tpi: dokta

source: dog
tpi: dok

source: don't!
tpi: nogat!

source: door
tpi: dua

source: double
tpi: dabolim

source: doubt
tpi: tubel

source: down
tpi: daun

source: drain
tpi: baret

source: draw on a smoke
tpi: pulim smok

source: dress (woman
tpi: klos meri

source: drilling machine
tpi: boamasin

source: drink
tpi: dring

source: dripping
tpi: gris bilong bulmakau

source: drive
tpi: draivim

source: driver
tpi: draiva

source: drum
tpi: kundu

source: drunk
tpi: spak

source: dry
tpi: drai

source: duck
tpi: pato

source: dumb
tpi: mauspas

source: during
tpi: long taim bilong

source: dust
tpi: das

source: dusty
tpi: i gat dus

source: duty
tpi: wok

source: dysentery
tpi: pekpek blut

source: each
tpi: wanpela wanpela

source: ear
tpi: yau

source: early
tpi: bipotaim

source: earrings
tpi: ol bilas bilong ia

source: earth
tpi: graun

source: earthquake
tpi: guria

source: east
tpi: hap san i kamap

source: Easter
tpi: Ista

source: easy
tpi: isi

source: eat
tpi: kaikaim

source: edge
tpi: arere

source: educate
tpi: edukeitim

source: eel
tpi: maleo

source: egg
tpi: kiau

source: eight
tpi: et

source: either/or
tpi: ating

source: elaculate
tpi: marasin capsait

source: electric
tpi: lektrik

source: electricity
tpi: elektrik

source: elevator
tpi: lipt

source: embassy
tpi: haus luluai bilong longwe ples

source: empty
tpi: klia

source: enclose
tpi: banisim

source: enemy
tpi: birua

source: engine
tpi: ensin

source: English
tpi: Inglis

source: enjoy
tpi: hamamas tru

source: enormous
tpi: bikpela tru

source: enough
tpi: inap

source: envelope
tpi: skin pas

source: envy
tpi: mangal

source: epsom salts
tpi: solmarasin

source: equal
tpi: wankain

source: erect
tpi: sanapim

source: establish
tpi: kirapim

source: Europeans
tpi: mastamisis

source: eve
tpi: ai

source: evening
tpi: apinun

source: everybody
tpi: olgeta

source: everything
tpi: olgeta samting

source: everywhere
tpi: long olgeta ples

source: exactly
tpi: stret

source: example
tpi: wankain olsem

source: except
tpi: tasol i na gat

source: excite
tpi: sikrapim bel bilong

source: exert oneself
tpi: taitim bun

source: exhaust pipe
tpi: eksospaip

source: exhibition
tpi: so

source: exist
tpi: stap

source: exit
tpi: dua i go ausait

source: expect
tpi: wetim

source: expensive
tpi: dia

source: explain
tpi: toksave

source: extremely
tpi: tumas

source: eyebrow
tpi: gras bilong ai

source: eyelash
tpi: gras bilong ai

source: fable
tpi: tok bilong bipo yet

source: face
tpi: pes

source: fact
tpi: em i tru

source: fail
tpi: pelim

source: fall down
tpi: pundaun

source: false
tpi: giaman

source: family
tpi: lain

source: famous
tpi: i gat biknem

source: fan
tpi: brum bilong winim pes

source: far
tpi: longwe

source: fare
tpi: fe

source: farmer
tpi: man bilong wokim gaden

source: fast
tpi: kwik

source: fasten
tpi: pasim

source: fat
tpi: wel

source: father
tpi: papa

source: fault
tpi: asua

source: feather
tpi: gras bilong pisin

source: February
tpi: Februeri

source: feel
tpi: filim

source: fell a tree
tpi: katim diwai i pundaun

source: fellow worker
tpi: wanwok

source: female
tpi: meri

source: fence
tpi: banis

source: festered wound
tpi: sua i sting

source: festival
tpi: singsing

source: fetch
tpi: kisim . . . i kam

source: fever
tpi: skin i hat

source: few
tpi: wan wan or lik lik

source: field
tpi: ples kunai

source: fifty
tpi: five

source: fight
tpi: pait

source: file
tpi: fail

source: fill
tpi: pulapim

source: film
tpi: pilum

source: filter
tpi: pilta

source: fin of fish
tpi: pul bilong pis

source: finally
tpi: pinis tru

source: find
tpi: painim pinis

source: find out
tpi: painim aut

source: fine hair
tpi: mosong

source: finery
tpi: bilas

source: finger
tpi: pinga

source: fingernail
tpi: kapa bilong pinga

source: finish
tpi: pinis

source: fire
tpi: paia

source: first
tpi: pastaim

source: firstly
tpi: pastaim

source: fish
tpi: pis

source: five
tpi: faiv

source: fix
tpi: fiksim

source: flat
tpi: stret

source: flatter
tpi: tok grisim

source: floor
tpi: plua

source: flour
tpi: plaua

source: flower
tpi: plaua

source: fly
tpi: lang

source: flying fox
tpi: blakbokis

source: fog
tpi: sno

source: fold paper/clothes
tpi: brukim pepa/klos

source: follow
tpi: bihainim

source: food
tpi: kaikai

source: fool
tpi: giamanim

source: foot
tpi: lek

source: football
tpi: kikbal

source: footprint
tpi: mak bilong fut

source: for
tpi: wankain olsem

source: for no reason
tpi: nating

source: forbidden
tpi: i tambu

source: forbidden place
tpi: ples tambu

source: force
tpi: pawa

source: foreign
tpi: bilong longwe ples

source: foreleg
tpi: han

source: forest
tpi: bus

source: forget
tpi: lusim

source: forget about
tpi: maski

source: forgive
tpi: lusim

source: fork
tpi: pok

source: former
tpi: bipo

source: formerly
tpi: bipo

source: fornicate
tpi: sikrapim bel bilong

source: fortnight
tpi: fotnait

source: forwards
tpi: poret

source: found
tpi: kirapim

source: four
tpi: fo

source: fowl
tpi: kakaruk

source: fracture
tpi: bun i bruk

source: free
tpi: i no gat man o meri

source: fresh
tpi: nupela

source: Friday
tpi: Fraide

source: fried
tpi: i bin praim

source: friend
tpi: poro

source: frightened
tpi: pret

source: frog
tpi: rokrok

source: from
tpi: bilong

source: frond
tpi: panggal

source: front
tpi: fran

source: front of
tpi: ai bilong

source: frontier
tpi: arere bilong kantri

source: frosted glass
tpi: grileglas

source: frozen
tpi: i ais pinis

source: fruit
tpi: pikinini bilong diwai

source: fry
tpi: praim

source: full
tpi: pulap

source: full up
tpi: pulap

source: funnyman
tpi: paniman

source: fur
tpi: gras

source: fuzz
tpi: mosong

source: G
tpi: string

source: gallon
tpi: galen

source: game
tpi: abus

source: garden
tpi: gaden

source: garnish
tpi: abus

source: gasoline
tpi: bensin

source: gearbox
tpi: giabokis

source: gee!
tpi: oloboi

source: genitals
tpi: bokis

source: Germany
tpi: Jemeni

source: get
tpi: kisim

source: ghost
tpi: dewel bilong man i dai

source: gigolo
tpi: pamukman

source: ginger
tpi: gorgor

source: girl
tpi: gel

source: give
tpi: givim

source: give up
tpi: larim

source: glass
tpi: glas

source: glove
tpi: soken bilong han

source: glutton
tpi: man bilong kaikai

source: gnat
tpi: natnat

source: go
tpi: igo

source: goanna
tpi: palai

source: goat
tpi: meme

source: God
tpi: Got

source: gold
tpi: gol

source: good
tpi: gut

source: goods
tpi: kago

source: gossip about
tpi: tok baksait

source: government
tpi: gavman

source: gram
tpi: giram

source: grandparent
tpi: tumbuna

source: grapes
tpi: ol pikinini bilong rop wain

source: grass
tpi: gras

source: grave
tpi: hul

source: grease
tpi: wel

source: green
tpi: grin

source: greet
tpi: tok gude

source: grey
tpi: gre

source: grill
tpi: kukim long paia

source: groin
tpi: sangana

source: ground
tpi: graun

source: ground oven
tpi: mumu

source: group
tpi: lain

source: grow
tpi: gro

source: guard
tpi: sambai long

source: guava
tpi: yambo

source: guest
tpi: pasindia

source: guide
tpi: man i soim rot or gait

source: guidebook
tpi: buk em i soim rot

source: guilt
tpi: hevi

source: gullet
tpi: mambu bilong nek

source: gun
tpi: masket

source: hair
tpi: gras

source: haircut
tpi: katim gras

source: hairdresser
tpi: man i save katim gras bilong het

source: half
tpi: hap

source: hallway
tpi: ples wokabaut insait long haus

source: halve
tpi: hapim

source: ham
tpi: lek bilong pik

source: hammer
tpi: hama

source: hand
tpi: han

source: handbag
tpi: hanpaus

source: handkerchief
tpi: hankisip

source: hang up
tpi: hangamapim

source: happy
tpi: amamas

source: harbour
tpi: pasis

source: hard
tpi: hat

source: harlot
tpi: pamuk meri

source: harvest
tpi: kamautim

source: hate
tpi: no laikim tru

source: hatred
tpi: pasin birua

source: have
tpi: gat

source: he
tpi: em

source: head
tpi: het

source: headache
tpi: het i pen

source: headlamps
tpi: sutlam

source: heal
tpi: drai

source: hear
tpi: harim

source: heart
tpi: klok

source: heat
tpi: hotim

source: heathen
tpi: hiden

source: heaven
tpi: heven

source: heavy
tpi: hevi

source: height
tpi: longpela bilong em

source: hell
tpi: hel

source: helmet
tpi: hat ain

source: help
tpi: halivim

source: her
tpi: bilong em

source: here
tpi: hia

source: hide
tpi: haitim

source: high
tpi: antap

source: highway
tpi: haiwe

source: hill
tpi: maunten

source: hind leg
tpi: lek

source: his
tpi: bilong em

source: hit
tpi: paitim

source: hoarse
tpi: nek i pas

source: hold
tpi: holim

source: hold up
tpi: hansapim

source: holy
tpi: tambu

source: home
tpi: haus

source: home town
tpi: asples bilong mi

source: honest
tpi: stret

source: honey
tpi: hani

source: hook
tpi: huk

source: hope
tpi: hop

source: horn
tpi: hon

source: hornbill
tpi: kokomo

source: horse
tpi: hos

source: hospital
tpi: haus sik

source: host
tpi: bos bilong haus

source: hostess
tpi: hostes

source: hostility
tpi: pasin binua

source: hot
tpi: hat

source: hour
tpi: aua

source: house
tpi: haus

source: how
tpi: olsem wanem

source: how much/many
tpi: hamas

source: however
tpi: tasol

source: humility
tpi: daunpasin

source: hundred
tpi: wan handet
